<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 138.0.3351.95--><displayName/><description/><resources><stringTable><string id="Network_group">Configurações da rede</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Faça Access-Control-Allow-Methods correspondente em CORS conformidade com as especificações de simulação</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Essa política controla se os métodos de solicitação estão em letras maiúsculas ao fazer a correspondência com os cabeçalhos de resposta Access-Control-Allow-Methods no pré-lançamento de CORS.

Se você desativar essa política, os métodos de solicitação ficarão em letras maiúsculas. Esse é o comportamento em ou antes de Microsoft Edge 108.

Se você habilitar ou não configurar essa política, os métodos de solicitação não serão ficarão em letras maiúsculas, a menos que haja correspondência insensível a maiúsculas e minúsculas com DELETE, GET, HEAD, OPTIONS, POST ou PUT.

Isso rejeitaria o cabeçalho de resposta fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot;,
e aceitaria o cabeçalho de resposta fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot;.

Observação: os métodos de solicitação &quot;post&quot; e &quot;put&quot; não são afetados, enquanto &quot;patch&quot;é afetado.

Essa política é temporária e será removida no futuro.</string><string id="BlockTruncatedCookies">Bloquear cookies truncados (obsoleto)</string><string id="BlockTruncatedCookies_Explain">OBSOLETO: Essa política é obsoleta e não funciona após o Microsoft Edge 131.

Esta política fornece uma recusa temporária para alterações de como o Microsoft Edge manipula cookies definidos via JavaScript que contêm determinados caracteres de controle (NULL, retorno de carro e alimentação de linha).
Anteriormente, a presença de qualquer um desses caracteres em uma cadeia de caracteres de cookie faria com que ela seja truncada, mas ainda assim definida.
Agora, a presença desses caracteres fará com que toda a cadeia de caracteres de cookie seja ignorada.

Se você habilitar ou não configurar esta política, o novo comportamento será habilitado.

Se você desabilitar essa política, o comportamento antigo será habilitado.

Esta política está obsoleta porque ela foi originalmente implementada como uma medida de segurança em caso de interrupção, mas nenhuma foi relatada.</string><string id="ZstdContentEncodingEnabled">Habilitar suporte à codificação de conteúdo zstd (obsoleto)</string><string id="ZstdContentEncodingEnabled_Explain">OBSOLETO: Essa política é obsoleta e não funciona após o Microsoft Edge 137.

Esta política controla se Microsoft Edge oferece suporte à codificação de conteúdo Zstandard (zstd).

Habilitado – o Edge anuncia o zstd no cabeçalho da solicitação Accept-Encoding e pode descompactar respostas codificadas com zstd.

Desabilitado – o Edge não anuncia nem oferece suporte à codificação de conteúdo zstd.

Não configurado – o comportamento padrão é habilitar o suporte à codificação de conteúdo zstd.

OBSERVAÇÃO:
Esta política tornou-se obsoleta a partir de Microsoft Edge versão 138 porque Microsoft Edge agora sempre oferece suporte à codificação de conteúdo zstd.</string><string id="WebView2LoaderOverrideSettings_group">Configurações de substituição do carregador</string><string id="BrowserExecutableFolder">Configurar o local da pasta executável do navegador</string><string id="BrowserExecutableFolder_Explain">Esta política configura aplicativos WebView2 para usar o WebView2 Runtime no caminho especificado. A pasta deve conter os seguintes arquivos: msedgewebview2.exe, msedge.dll e assim por diante.

Para definir o valor do caminho da pasta, forneça um Nome de valor e do Par do valor. Defina o nome do valor como a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.

Exemplo de valor:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurar o local da pasta executável do navegador</string><string id="ChannelSearchKind">Configurar o tipo de pesquisa do canal de lançamento do WebView2</string><string id="ChannelSearchKind_Explain">Essa política configura o tipo de pesquisa do canal para aplicativos WebView2. Por padrão, o tipo de pesquisa de canal é 0, que é equivalente ao tipo de pesquisa &quot;Mais Estável&quot; na API do WebView2 correspondente; Isso indica que a criação do ambiente do WebView2 deve procurar um canal de lançamento do mais para o menos estável: WebView2 Runtime, Beta, Dev e Canary.

Para inverter a ordem de pesquisa padrão e usar o tipo de pesquisa &quot;Menos Estável&quot;, defina essa política como 1.

Para definir o valor do tipo de pesquisa do canal, forneça um nome e um par de Valores. Defina o nome do valor como a ID do Modelo de Usuário do Aplicativo ou o nome do arquivo executável. Você pode usar o curinga &quot;*&quot; como o nome de valor para aplicar a todos os aplicativos.

Exemplo de valor:

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Configurar o tipo de pesquisa do canal de lançamento do WebView2</string><string id="ReleaseChannelPreference">Definir a preferência de ordem de pesquisa do canal de lançamento (preterida)</string><string id="ReleaseChannelPreference_Explain">PRETERIDA: essa política foi preterida. No momento, ela tem suporte, mas ficará obsoleta em uma versão futura.

Essa política foi preterida em favor de ChannelSearchKind, que tem a mesma funcionalidade, e se tornará obsoleta na versão 124. A ordem de pesquisa de canal padrão é WebView2 Runtime, Beta, Dev e Canary.

Para inverter a ordem de pesquisa padrão, defina essa política como 1.

Para definir o valor da preferência do canal de lançamento, forneça um nome e um par de Valores. Defina o nome do valor como a ID do Modelo de Usuário do Aplicativo ou o nome do arquivo executável. Você pode usar o curinga &quot;*&quot; como o nome de valor para aplicar a todos os aplicativos.

Exemplo de valor:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Definir a preferência de ordem de pesquisa do canal de lançamento (preterida)</string><string id="ReleaseChannels">Configurar os canais de lançamento do WebView2</string><string id="ReleaseChannels_Explain">Essa política configura as opções do canal de lançamento para aplicativos WebView2. Para configurar essas opções, defina o valor como uma cadeia de caracteres separada por vírgulas de inteiros, que são mapeadas para os valores `COREWEBVIEW2_RELEASE_CHANNELS` da API do WebView2 correspondente. Esses valores são: WebView2 Runtime (0), Beta (1), Desenvolvimento (2) e Canary (3). Por padrão, a criação de ambiente procura canais do mais para o menos estável, usando o primeiro canal encontrado no dispositivo. Quando `ReleaseChannels` for fornecido, a criação de ambiente pesquisará apenas os canais especificados no conjunto. Por exemplo, os valores &quot;0,2&quot; e &quot;2,0&quot; indicam que a criação do ambiente deve pesquisar apenas o Canal do Desenvolvedor e o WebView2 Runtime, usando a ordem indicada por `ChannelSearchKind`. A criação do ambiente tenta interpretar cada inteiro e trata qualquer entrada inválida como o canal Estável. Defina `ChannelSearchKind` para inverter a ordem de pesquisa para que a criação do ambiente pesquise primeiro o build menos estável. Se `BrowserExecutableFolder` e `ReleaseChannels` forem fornecidos, `BrowserExecutableFolder` terá precedência, independentemente de o canal de `BrowserExecutableFolder` ser incluído em `ReleaseChannels`.

Para definir o valor dos canais de lançamento, forneça um nome e um par de Valores. Defina o nome do valor como a ID do Modelo de Usuário do Aplicativo ou o nome do arquivo executável. Você pode usar o curinga &quot;*&quot; como o nome de valor para aplicar a todos os aplicativos.

Exemplo de valor:

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Configurar os canais de lançamento do WebView2</string><string id="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Configuração e Experimentação</string><string id="ExperimentationAndConfigurationServiceControl_Explain">O Serviço de Configuração e Experimentação é usado para implantar conteúdos de Configuração e Experimentação para o cliente.

O conteúdo de experimentação consiste em uma lista de recursos iniciais de desenvolvimento que a Microsoft está habilitando para testes e comentários.

O conteúdo de configuração consiste em uma lista de configurações recomendadas que a Microsoft deseja implantar para otimizar a experiência do usuário.

O conteúdo da configuração também pode conter uma lista de ações a serem executadas em determinados domínios por razões de compatibilidade. Por exemplo, o navegador pode substituir a cadeia de caracteres de Agente de Usuário em um site se esse site estiver quebrado. Cada uma dessas ações deve ser temporária enquanto a Microsoft tenta resolver o problema com o proprietário do site.

Se você definir essa política como 'FullMode', o conteúdo total será baixado do Serviço de Configuração e Experimentação. Isso inclui os conteúdos de Configuração e Experimentação.

Se você definir esta política como 'ConfigurationsOnlyMode', somente o conteúdo de configuração será baixado.

Se você definir essa política como 'RestrictedMode', a comunicação com o Serviço de Configuração e Experimentação será interrompido completamente. A Microsoft não recomenda essa configuração.

Se você não configurar essa política em um dispositivo gerenciado, o comportamento nos canais Beta e Estável será o mesmo que no 'ConfigurationsOnlyMode'. Nos canais Canary e Dev, o comportamento é o mesmo que no 'FullMode'.

Se você não configurar essa política em um dispositivo não gerenciado, o comportamento será o mesmo que no 'FullMode'.

Mapeamento das opções da política:

* FullMode (2) = Recuperar configurações e experimentos

* ConfigurationsOnlyMode (1) = Recuperar apenas configurações

* RestrictedMode (0) = Desabilitar a comunicação com o Serviço de Configuração e Experimentação

Use as informações anteriores ao configurar essa política.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Recuperar configurações e experimentos</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Recuperar apenas configurações</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Desabilitar a comunicação com o Serviço de Configuração e Experimentação</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Controla se os manipuladores de eventos unload podem ser desabilitados.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">Os manipuladores de eventos unload estão sendo preteridos. Se eles disparam depende do unload Permissions-Policy.
Atualmente, eles são permitidos por política por padrão. No futuro, eles passarão gradualmente a ser proibidos por padrão e os sites deverão habilitá-los explicitamente usando cabeçalhos Permissions-Policy.
Essa política corporativa pode ser usada para desativar essa descontinuação gradual, forçando o padrão a permanecer habilitado.

As páginas podem depender dos manipuladores de eventos unload para salvar dados ou sinalizar o fim de uma sessão de usuário para o servidor.
Isso não é recomendado, pois não é confiável e afeta o desempenho bloqueando o uso de BackForwardCache.
Existem alternativas recomendadas, mas o evento unload é usado há muito tempo. Alguns aplicativos ainda podem depender deles.

Se você desabilitar esta política ou não configurá-la, os manipuladores de eventos unload serão gradualmente preteridos em linha com o lançamento de descontinuação e sites que não definem cabeçalhos Permissions-Policy irão parar de disparar eventos `unload`.

Se esta você habilitar esta política, os manipuladores de eventos unload continuarão funcionando por padrão.</string><string id="HttpAllowlist">Lista de Permissões HTTP</string><string id="HttpAllowlist_Explain">Definir a política especifica uma lista de nomes de host ou padrões de nome de host (como &quot;[*.]example.com&quot;) que não serão atualizados para HTTPS. As organizações podem usar essa política para manter o acesso a servidores que não dão suporte a HTTPS, sem a necessidade de desabilitar &quot;AutomaticHttpsDefault&quot; ou &quot;HttpsUpgradesEnabled&quot;.

Os nomes de host fornecidos devem ser canônicos: todos os IDNs devem ser convertidos para o formato de rótulo A e todas as letras ASCII devem ser minúsculas.

Caracteres curinga de host genéricos (ou seja, &quot;*&quot; ou &quot;[*]&quot;) não são permitidos. Em vez disso, o Modo HTTPS-First as Atualizações de HTTPS devem ser explicitamente desabilitados por meio de suas políticas específicas.

Observação: essa política não se aplica a atualizações do HSTS.

Exemplo de valor:

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">Lista de Permissões HTTP</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Permite habilitar o recurso NewBaseUrlInheritanceBehavior (obsoleto)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">OBSOLETO: Essa política é obsoleta e não funciona após o Microsoft Edge 135.

NewBaseUrlInheritanceBehavior é um recurso Microsoft Edge que faz com que os quadros about:blank e about:srcdoc herdem consistentemente seus valores de base URL por meio de instantâneos de base URL do iniciador.

Se você desabilitar essa política, impedirá que usuários ou variações Microsoft Edge habilitem o NewBaseUrlInheritanceBehavior, caso sejam descobertos problemas de compatibilidade.

Se você habilitar ou não configurar essa política, será possível habilitar o NewBaseUrlInheritanceBehavior.

A política foi tornada obsoleta a partir da versão 136 do Microsoft Edge, mas o recurso NewBaseUrlInheritanceBehaviorAllowed foi removido na versão 123 do Microsoft Edge.</string><string id="NewPDFReaderWebView2List">Habilitar leitor de PDF interno da plataforma Adobe Acrobat para WebView2</string><string id="NewPDFReaderWebView2List_Explain">Essa política configura os aplicativos WebView2 para iniciar a nova versão do leitor de PDF que é da plataforma Adobe Acrobat. O novo leitor de PDF garante que não haja perda de funcionalidade e oferece uma experiência de PDF aprimorada. Essa experiência inclui renderização mais avançada, desempenho aprimorado, segurança robusta para o manuseio de arquivos PDF e maior acessibilidade.

Se essa política for especificada para um aplicativo, é possível que ela também afete outros aplicativos relacionados. A política é aplicada a todos os WebView2s que compartilham a mesma pasta de dados do usuário do WebView2. Esses WebView2s podem pertencer a vários aplicativos se esses aplicativos, que provavelmente pertencem à mesma família de produtos, forem projetados para compartilhar a mesma pasta de dados do usuário.

Use um par nome-valor para habilitar o novo leitor de PDF para o aplicativo. Defina o nome como a ID do modelo do usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos. Defina o valor como verdadeiro para habilitar o novo leitor ou defina-o como falso para usar o existente.

Se você ativar essa política para os aplicativos WebView2 especificados, eles usarão o novo leitor de PDF da plataforma Adobe Acrobat para abrir todos os arquivos PDF.

Se você desabilitar a política para os aplicativos WebView2 especificados ou não a configurar, eles usarão o leitor de PDF existente para abrir todos os arquivos PDF.

Exemplo de valor:

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Habilitar leitor de PDF interno da plataforma Adobe Acrobat para WebView2</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Verifique o uso da chave RSA para certificados de servidor emitidos por âncoras de confiança locais (obsoleto)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">OBSOLETO: Essa política é obsoleta e não funciona após o Microsoft Edge 135.

A extensão de uso de chave X.509 declara como a chave em um certificado pode ser
usada. Essas instruções garantem que os certificados não sejam usados de forma não intencional em um
contexto, que protege contra uma classe de ataques entre protocolos em HTTPS e
outros protocolos. Os clientes HTTPS devem verificar se os certificados do servidor correspondem aos
parâmetros TLS da conexão.

A partir do Microsoft Edge 124, essa
verificação estará sempre habilitada.

Microsoft Edge 123 e anteriores têm o
seguinte comportamento:

Se esta política estiver habilitada,
Microsoft Edge executará essa verificação de
chave. Isso ajuda a impedir os ataques em que um invasor manipula o navegador para
interpretar uma chave de maneiras que o proprietário do certificado não pretendia.

Se essa política estiver desabilitada,
Microsoft Edge pulará essa verificação de chave nas
conexões HTTPS que negociam TLS 1.2 e usam um certificado RSA que
encadeia para uma âncora de confiança local. Exemplos de âncoras de confiança locais incluem
certificados raiz fornecidos pela política ou instalados pelo usuário. Em todos os outros casos, a
verificação é executada independentemente da configuração dessa política.

Se essa política não estiver configurada,
Microsoft Edge se comportará como se a
política estivesse habilitada.

Essa política está disponível para que os administradores visualizem o comportamento de uma
futura versão, que habilitará esta verificação por padrão. Nesse momento, essa
política permanecerá temporariamente disponível para administradores que precisam de mais
tempo para atualizar seus certificados para atender aos novos requisitos de uso de chave RSA.

Conexões que não passarem nessa verificação falharão com o erro
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Os sites que falharem com esse erro provavelmente possuem um
certificado configurado incorretamente. Os conjuntos de criptografia ECDHE_RSA modernos usam a
opção de uso da chave &quot;digitalSignature&quot;, enquanto os conjuntos de criptografia RSA herdados de descriptografia
usam a opção &quot;keyEncipherment&quot;. Em caso de dúvida, os administradores devem
incluir ambas em certificados RSA destinados a HTTPS.

A política foi tornada obsoleta a partir da versão 136 do Microsoft Edge,
mas a verificação de chave sempre esteve habilitada desde a versão 124 de Microsoft Edge.</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge versão 97, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge versão 116, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge versão 118, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge versão 87, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V121">Microsoft Edge versão 121, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V123">Microsoft Edge versão 123, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V125">Microsoft Edge versão 125, Windows 7 ou posterior</string><string id="OBSOLETE_WIN7_V123_V135">Microsoft Edge versão 123-135, Windows 7 ou posterior</string><string id="OBSOLETE_WIN7_V125_V137">Microsoft Edge versão 125-137, Windows 7 ou posterior</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge versão 123-131, Windows 7 ou posterior</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Configurações Padrão (os usuários podem substituir)</string></stringTable><presentationTable><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Configuração e Experimentação</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">Lista de Permissões HTTP</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>